import java.util.Scanner;

// /Написать программу вычисления n-ого треугольного числа.

public class Homework_1 {
    public static void main(String[] args) {
        
    }
    
// Ввод  n размера треугольного числа

public static int inputNumber () {
    Scanner sc = new Scanner(System.in);
    System.out.print("Введите число: ");
    int num = sc.nextInt();
    return num;
}

}